SM_для_EDT/src/Documents/впВыявленныеДефекты/впВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впВыявленныеДефекты</name>
  <basedOn>Document.впВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.впВыявленныеДефекты</basedOn>
  <basedOn>Document.впАктОВыполненииЭтапаРабот</basedOn>
  <registerRecords>InformationRegister.впВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.впУсловияВыявленияДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстраненияДефекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.впВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.впПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.впКритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.впВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.впВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/впВыявленныеДефектыПрисоединенныеФайлы/впВыявленныеДефектыПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>впВыявленныеДефектыПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.впВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если Тип хранения файла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как Хранилище значения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если Тип хранения файла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в распределенной информационной базе</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Documents/впВыявленныеДефекты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	// ++ rarus selmik 29.03.2021
	Если Не Отказ Тогда
		ОбъектыРемонтаСтрокой_ДоИзменения = ОбъектыРемонтаСтрокой;
		ОбъектыРемонтаСтрокой_НовоеЗначение = "";
		
		РемонтыОборудованияТЗ = СписокДефектов.Выгрузить(,"ОтказавшийЭлемент");
		РемонтыОборудованияТЗ.Свернуть("ОтказавшийЭлемент");
		
		Для Каждого	ЭлементОбъектРемонта Из РемонтыОборудованияТЗ Цикл
			Если ЗначениеЗаполнено(ЭлементОбъектРемонта.ОтказавшийЭлемент) Тогда
				
				Если Не ЗначениеЗаполнено(ОбъектыРемонтаСтрокой_НовоеЗначение) Тогда
					ОбъектыРемонтаСтрокой_НовоеЗначение = ЭлементОбъектРемонта.ОтказавшийЭлемент.Наименование;
				Иначе
					ОбъектыРемонтаСтрокой_НовоеЗначение = ОбъектыРемонтаСтрокой_НовоеЗначение + "; " + ЭлементОбъектРемонта.ОтказавшийЭлемент.Наименование;
				КонецЕсли;
				
			КонецЕсли;			
		КонецЦикла;
		
		Если ОбъектыРемонтаСтрокой_ДоИзменения <> ОбъектыРемонтаСтрокой_НовоеЗначение Тогда
			ОбъектыРемонтаСтрокой = ОбъектыРемонтаСтрокой_НовоеЗначение;	
		КонецЕсли;
	КонецЕсли;
	// -- rarus selmik 29.03.2021
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ++ rarus selmik 21.12.2020 25003
	МассивКритичностей = СписокДефектов.ВыгрузитьКолонку("КритичностьДефекта");
	Если МассивКритичностей.Найти(Справочники.впКритичностьДефекта.Высокая) <> Неопределено Тогда
		ПроверкаНаличияФайла(Отказ);	
	КонецЕсли;
	// -- rarus selmik 21.12.2020 25003
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("МассивСтрокТЧ") Тогда
			Для каждого Строка из ДанныеЗаполнения.МассивСтрокТЧ Цикл
				НоваяСтрока = СписокДефектов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.впВнешнееОснованиеДляРабот") Тогда
		
		Дата = ДанныеЗаполнения.Дата;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Организация = ДанныеЗаполнения.Организация;
		ДокументыОснования.Добавить().ДокументОснование = ДанныеЗаполнения;
		Для Каждого СтрТЧосн из  ДанныеЗаполнения.ОбследованноеОборудование Цикл
			СтрТЧ = СписокДефектов.Добавить();
			СтрТЧ.ID = СтрТЧосн.ID;
			СтрТЧ.ОтказавшийЭлемент = СтрТЧосн.ОбъектРемонта;
			СтрТЧ.ДефектОписание = СтрТЧосн.Описание;
			СтрТЧ.ДатаНачалаРемонта = СтрТЧосн.ПлановаяДатаРемонта;
			СтрТЧ.ДатаОкончанияРемонта = СтрТЧосн.ПлановаяДатаРемонта;
			СтрТЧ.ДокументИсточник = ДанныеЗаполнения;
			СтрТЧ.ЗакрываетПредписание = Истина;
		КонецЦикла;
		
	// ++ rarus selmik 21.12.2020 25003
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.впАктОВыполненииЭтапаРабот") Тогда
		
		Дата 					= ДанныеЗаполнения.Дата;
		ДатаУстраненияДефекта	= ДанныеЗаполнения.Дата;
		Подразделение 			= ДанныеЗаполнения.Подразделение;
		Организация 			= ДанныеЗаполнения.Организация;
		Ответственный 			= Пользователи.ТекущийПользователь();
		ДефектВыявленВПроцессе	= Справочники.впУсловияВыявленияДефекта.ПлановыйОсмотр;
		ДокументыОснования.Добавить().ДокументОснование = ДанныеЗаполнения;
				
		Для Каждого СтрокаТаблицы из ДанныеЗаполнения.РемонтыОборудования Цикл
			СтрокаДобавл = СписокДефектов.Добавить();
			СтрокаДобавл.ID 					= Новый УникальныйИдентификатор();
			СтрокаДобавл.ДатаНачалаРемонта 		= СтрокаТаблицы.ДатаНачала;
			СтрокаДобавл.ДатаОкончанияРемонта 	= СтрокаТаблицы.ДатаОкончания;
			СтрокаДобавл.ОтказавшийЭлемент 		= СтрокаТаблицы.ОбъектРемонта;
			СтрокаДобавл.КритичностьДефекта 	= СтрокаТаблицы.КритичностьДефекта;
			СтрокаДобавл.ДокументИсточник 		= ДанныеЗаполнения;
			СтрокаДобавл.ДефектОписание			= СтрокаТаблицы.ОписаниеРемонта;
			СтрокаДобавл.ЗакрываетПредписание 	= СтрокаТаблицы.ЗакрываетПредписание;
		КонецЦикла;			
			
	// -- rarus selmik 21.12.2020 25003
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли
Процедура ПриКопировании(ОбъектКопирования)
	
	Для каждого Строка Из СписокДефектов Цикл
        Строка.ДатаНачалаРемонта                      = Дата("00010101");
        Строка.ДатаОкончанияРемонта                   = Дата("00010101");
		Строка.ID = Новый УникальныйИдентификатор();
	КонецЦикла; 
	
КонецПроцедуры

// ++ rarus selmik 21.12.2020 25003
Процедура ПроверкаНаличияФайла(Отказ)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	впВыявленныеДефектыПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.впВыявленныеДефектыПрисоединенныеФайлы КАК впВыявленныеДефектыПрисоединенныеФайлы
	|ГДЕ
	|	впВыявленныеДефектыПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ впВыявленныеДефектыПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Для высокой критичности дефекта, нужно обязательно добавить файл.");
	КонецЕсли;
	
	
КонецПроцедуры	// -- rarus selmik 21.12.2020 25003
